#+TITLE: Python
#+AUTHOR: LavenLiu
#+DATE: 2010-05-04
#+EMAIL: ldczz2008@163.com 

#+STARTUP: OVERVIEW
#+TAGS: OFFICE(o) HOME(h) PROJECT(p) CHANGE(c) REPORT(r) ZY(y) MYSELF(m) 
#+TAGS: PROBLEM(P) INTERRUPTTED(i) RESEARCH(R)
#+SEQ_TODO: TODO(t)  STARTED(s) WAITING(W) | DONE(d) CANCELLED(C) DEFERRED(f)
#+COLUMNS: %40ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}

** 解压序列赋值给多个变量
   任何的序列(或者是可迭代对象)可以通过一个简单的赋值语句解压并赋值给
   多个变量。 唯一的前提就是变量的数量必须跟序列元素的数量是一样的。
   
   如果变量个数和序列元素的个数不匹配，会产生一个异常。
#+BEGIN_SRC python :results output :session
data = [ 'ACME', 50, 91.1, (2012, 12, 21) ]
name, shares, price, date = data
name
date
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
: 
: 'ACME'
: (2012, 12, 21)
#+END_EXAMPLE

#+BEGIN_SRC python :results output :session
name, shares, price, (year, mon, day) = data
year
mon
day
#+END_SRC

#+BEGIN_EXAMPLE
 : 
 : 2012
 : 12
 : 21
#+END_EXAMPLE

	实际上，这种解压赋值可以用在任何可迭代对象上面，而不仅仅是列表或者
	元组。 包括字符串，文件对象，迭代器和生成器。
#+BEGIN_SRC python :results output :session
s = 'Hello'
a, b, c, d, e = s
a
b
e
#+END_SRC

#+RESULTS:
: 
: 'H'
: 'e'
: 'o'

	有时候，你可能只想解压一部分，丢弃其他的值。对于这种情况Python并没
	有提供特殊的语法。 但是你可以使用任意变量名去占位，到时候丢掉这些
	变量就行了。
#+BEGIN_SRC python :results output :session
data = ['ACME', 50, 90.1, (2015,12,29)]
_, shares, price, _ = data
shares
price
#+END_SRC

#+RESULTS:
: 
: >>> 50
: 90.1

